## Domain â€“ Education

### Data Wrangling

In [2]:
## Importing libraries
import numpy as np
import pandas as pd

#### Reading score from files

In [4]:
df_math=pd.read_csv(r"./datasets/MathScoreTerm1.csv")
df_ds=pd.read_csv(r"./datasets/DSScoreTerm1.csv")
df_physics=pd.read_csv(r"./datasets/PhysicsScoreTerm1.csv")

In [10]:
## Dropping columns to make data confidential
df_math = df_math.drop(['Name','Ethinicity'],axis=1)
df_physics = df_physics.drop(['Name','Ethinicity'],axis=1)
df_ds = df_ds.drop(['Name','Ethinicity'],axis=1)

### Performing Data Wrangling on Maths score

In [11]:
df_math.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [12]:
df_math.describe()

            Score         Age          ID
count  596.000000  599.000000  599.000000
mean    74.348993   19.121870  300.000000
std     16.217918    1.052234  173.060683
min     31.000000   18.000000    1.000000
25%     65.000000   18.000000  150.500000
50%     78.500000   19.000000  300.000000
75%     88.000000   20.000000  449.500000
max     95.000000   21.000000  599.000000

In [13]:
df_math.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    596 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

In [14]:
df_math.isnull().sum()

Score      3
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

##### Score has 3 rows as null. Replacing null with Zeros

In [15]:
df_math['Score'] = df_math['Score'].fillna(0)
df_math.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

##### Performing Data Wrangling on Physics score

In [16]:
df_physics.head()

   Score  Age  Subject Sex  ID
0   84.0   18  Physics   M   1
1   81.0   19  Physics   M   2
2   41.0   19  Physics   M   3
3   78.0   18  Physics   M   4
4   78.0   18  Physics   F   5

In [17]:
df_physics.describe()

            Score         Age          ID
count  593.000000  599.000000  599.000000
mean    70.598651   19.121870  300.000000
std     15.997280    1.052234  173.060683
min     27.000000   18.000000    1.000000
25%     61.000000   18.000000  150.500000
50%     78.000000   19.000000  300.000000
75%     84.000000   20.000000  449.500000
max     94.000000   21.000000  599.000000

In [18]:
df_physics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    593 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

In [19]:
df_physics.isnull().sum()

Score      6
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

##### Score has 6 rows as null. Replacing null with Zero's

In [20]:
df_physics['Score'] = df_physics['Score'].fillna(0)
df_physics.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

##### Performing Data Wrangling on DS score

In [21]:
df_ds.head()

   Score  Age        Subject Sex  ID
0   82.0   18  Data Structue   M   1
1   79.0   19  Data Structue   M   2
2   39.0   19  Data Structue   M   3
3   76.0   18  Data Structue   M   4
4   76.0   18  Data Structue   F   5

In [22]:
df_ds.describe()

            Score         Age          ID
count  591.000000  599.000000  599.000000
mean    68.367174   19.121870  300.000000
std     16.161543    1.052234  173.060683
min     25.000000   18.000000    1.000000
25%     59.000000   18.000000  150.500000
50%     69.000000   19.000000  300.000000
75%     82.000000   20.000000  449.500000
max     89.000000   21.000000  599.000000

In [23]:
df_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score    591 non-null    float64
 1   Age      599 non-null    int64
 2   Subject  599 non-null    object
 3   Sex      599 non-null    object
 4   ID       599 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 23.5+ KB

In [24]:
df_ds.isnull().sum()

Score      8
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

##### Score has 8 rows as null. Replacing null with Zero's

In [25]:
df_ds['Score'] = df_ds['Score'].fillna(0)
df_ds.isnull().sum()

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

#### Merging these 3 dataframs into one

In [26]:
df_final = pd.concat([df_math,df_physics,df_ds])
df_final.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [28]:
df_final['Subject'].value_counts(sort=False)

Physics          599
Data Structue    599
Maths            599
Name: Subject, dtype: int64

#### Change Sex(M/F) Column to 1/2 for further analysis

In [29]:
map_condition = {'M':1,'F':2}
df_final['Sex'] = df_final['Sex'].map(map_condition).astype(int)

In [32]:
df_final.head()

   Score  Age Subject  Sex  ID
0   88.0   18   Maths    1   1
1   85.0   19   Maths    1   2
2   45.0   19   Maths    1   3
3   82.0   18   Maths    1   4
4   82.0   18   Maths    2   5

In [33]:
df_final['Sex'].value_counts(sort=False)

1    1440
2     357
Name: Sex, dtype: int64

#### Store the data in new file â€“ ScoreFinal.csv

In [34]:
## Writing the data of Dataframe into a CSV file on local disk
df_final.to_csv(r"./datasets/ScoreFinal.csv")

### Enhancements for code
#### You can try these enhancements in code
#### 1. Convert ethnicity to numerical value
#### 2. Fill the missing score for a student to the average of the class

In [49]:
## Reading data into dataframe
df_math=pd.read_csv(r"./datasets/MathScoreTerm1.csv")
df_ds=pd.read_csv(r"./datasets/DSScoreTerm1.csv")
df_physics=pd.read_csv(r"./datasets/PhysicsScoreTerm1.csv")

In [50]:
## Dropping columns to make data confidential
df_math = df_math.drop(['Name'],axis=1)
df_physics = df_physics.drop(['Name'],axis=1)
df_ds = df_ds.drop(['Name'],axis=1)

##### Convert ethnicity to numerical value

In [51]:
df_math['Ethinicity'].value_counts(sort=False)

Hispanic             124
African American      31
White American       288
European American    156
Name: Ethinicity, dtype: int64

In [52]:
df_physics['Ethinicity'].value_counts(sort=False)

Hispanic             124
African American      31
White American       288
European American    156
Name: Ethinicity, dtype: int64

In [53]:
df_ds['Ethinicity'].value_counts(sort=False)

Hispanic             124
African American      31
White American       288
European American    156
Name: Ethinicity, dtype: int64

##### There are 4 distinct values of Ethinicity
##### Relacing Ethinicity with a numeric value

In [54]:
## For Maths
ethinicity_condition = {'Hispanic':1,'African American':2,'White American':3,'European American':4}

df_math['Ethinicity'] = df_math['Ethinicity'].map(ethinicity_condition).astype(int)

df_math['Ethinicity'].value_counts(sort=False)

1    124
2     31
3    288
4    156
Name: Ethinicity, dtype: int64

In [55]:
## For Physics
df_physics['Ethinicity'] = df_physics['Ethinicity'].map(ethinicity_condition).astype(int)

df_physics['Ethinicity'].value_counts(sort=False)

1    124
2     31
3    288
4    156
Name: Ethinicity, dtype: int64

In [56]:
## For DS
df_ds['Ethinicity'] = df_ds['Ethinicity'].map(ethinicity_condition).astype(int)

df_ds['Ethinicity'].value_counts(sort=False)

1    124
2     31
3    288
4    156
Name: Ethinicity, dtype: int64

##### Fill the missing score for a student to the average of the class

In [57]:
df_math.isnull().sum()

Score         3
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [58]:
df_math['Score'] = df_math['Score'].fillna(df_math['Score'].mean())
df_math.isnull().sum()

Score         0
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [59]:
df_physics.isnull().sum()

Score         6
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [60]:
df_physics['Score'] = df_physics['Score'].fillna(df_physics['Score'].mean())
df_physics.isnull().sum()

Score         0
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [61]:
df_ds.isnull().sum()

Score         8
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [63]:
df_ds['Score'] = df_ds['Score'].fillna(df_ds['Score'].mean())
df_ds.isnull().sum()

Score         0
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

#### Combining all 3 dataframes

In [64]:
df_final = pd.concat([df_math,df_physics,df_ds])
df_final.head()

   Score  Age  Ethinicity Subject Sex  ID
0   88.0   18           3   Maths   M   1
1   85.0   19           4   Maths   M   2
2   45.0   19           4   Maths   M   3
3   82.0   18           3   Maths   M   4
4   82.0   18           3   Maths   F   5

In [65]:
df_final['Subject'].value_counts(sort=False)

Physics          599
Data Structue    599
Maths            599
Name: Subject, dtype: int64

##### Mapping Sex columns for male and female

In [66]:
map_condition = {'M':1,'F':2}
df_final['Sex'] = df_final['Sex'].map(map_condition).astype(int)

In [67]:
df_final['Sex'].value_counts(sort=False)

1    1440
2     357
Name: Sex, dtype: int64

##### Storing into new CSV file

In [68]:
## Writing the data of Dataframe into a CSV file on local disk
df_final.to_csv(r"./datasets/ScoreFinal_enhanced.csv")